//=========================================================
//
// 敵の待機状態の末端ノード処理 [ arraywaitleaf.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "arraywaitleaf.h"
#include "array.h"
#include "motioninstancing.h"

//=========================================================
// 更新処理
//=========================================================
void CArrayWaitLeaf::Update()
{
	// ブラックボード取得
	auto* Array = m_pBlackBoard->GetValue<CArray*>("Array");

	// 待機時、モーション設定
	Array->GetMotion()->SetMotion(CArray::MOTION_NEUTRAL, true, 10);
}