//=========================================================
//
// 枝分かれノードクラス処理 [ branchnodebase.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "branchnodebase.h"

//=========================================================
// 初期化処理
//=========================================================
void CBranchNodeBase::Init()
{
	// 親クラスの初期化
	CNodeBase::Init();

	// 有効なら
	if (IsCondition())
	{
		// インデックス初期化
		m_nTrueIdx = BRANCH_NUM_TRUE;
	}
	else
	{
		m_nTrueIdx = BRANCH_NUM_FALSE;
	}

	// インデックスを使って対象ブランチのノードを初期化
	m_pBranchNode[m_nTrueIdx]->Init();
}
//=========================================================
// 更新処理
//=========================================================
void CBranchNodeBase::Update()
{
	// 対象ブランチの更新処理
	m_pBranchNode[m_nTrueIdx]->Update();

	// ブランチの状態を反映させる
	m_NodeResult = m_pBranchNode[m_nTrueIdx]->get_node_result();
}
//=========================================================
// 終了処理
//=========================================================
void CBranchNodeBase::Exit()
{
	// 親クラスの終了処理
	CNodeBase::Exit();

	// 対象ブランチの終了処理
	m_pBranchNode[m_nTrueIdx]->Exit();

	// インデックス番号を変更
	m_nTrueIdx = BRANCH_NUM_FALSE;
}