//=========================================================
//
// 当たり判定基底処理クラス [ collision.cpp ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "collision.h"

//=========================================================
// コンストラクタ
//=========================================================
CCollision::CCollision(TYPE type) : m_Type(type),m_pos(VECTOR3_NULL)
{
	// 値のクリア
}
//=========================================================
// デストラクタ
//=========================================================
CCollision::~CCollision()
{
	// 無し
}
//=========================================================
// コリジョン生成処理
//=========================================================
CCollision* CCollision::Create(D3DXVECTOR3 pos, TYPE Type)
{
	// インスタンス生成
	CCollision* pCollision = new CCollision(Type);
	if (pCollision == nullptr) return nullptr;

	// 値をセット
	pCollision->SetPos(pos);
	pCollision->SetType(Type);

	// 生成されたポインタ
	return pCollision;
}
