//=========================================================
//
// 敵の攻撃ノードの管理クラス [ enemyattackleaf.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemyattackleaf.h"
#include "array.h"
#include "arraymanager.h"
#include "gamesceneobject.h"

//=========================================================
// 更新関数処理
//=========================================================
void CEnemyAttackLeaf::Update()
{
	// ターゲットを取得する

}