//=========================================================
//
// 負けリザルト出現するオブジェクト管理処理 [ loseresultobject.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "loseresultobject.h"
#include "ui.h"

//*********************************************************
// 静的メンバ変数宣言
//*********************************************************
CLoseResultObject* CLoseResultObject::m_pInstance = nullptr; // シングルトン変数

//*********************************************************
// 定数宣言空間
//*********************************************************
namespace LOSERESULTOBJECT
{
	constexpr float Height = 60.0f;							// UIの高さ
	constexpr const char* TexName = "result_loselogo.png";	// テクスチャ名
};

//=========================================================
// コンストラクタ
//=========================================================
CLoseResultObject::CLoseResultObject()
{

}
//=========================================================
// デストラクタ
//=========================================================
CLoseResultObject::~CLoseResultObject()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CLoseResultObject::Init(void)
{
	// UI生成
	CUi::Create(CENTERPOS, NULL, HALFWIDTH, LOSERESULTOBJECT::Height, LOSERESULTOBJECT::TexName);

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CLoseResultObject::Uninit(void)
{

}
//=========================================================
// インスタンス取得処理
//=========================================================
CLoseResultObject* CLoseResultObject::GetInstance(void)
{
	// nullなら
	if (m_pInstance == nullptr)
	{
		// インスタンス生成
		m_pInstance = new CLoseResultObject;
	}

	return m_pInstance;
}