//=========================================================
//
// 移動状態管理処理 [ playerstatemove.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatemove.h"
#include "manager.h"
#include "input.h"

//=========================================================
// コンストラクタ
//=========================================================
CPlayerStateMove::CPlayerStateMove()
{
	// IDセット
	SetID(ID_MOVE);
}
//=========================================================
// デストラクタ
//=========================================================
CPlayerStateMove::~CPlayerStateMove()
{

}
//=========================================================
// 開始関数
//=========================================================
void CPlayerStateMove::OnStart()
{
	// モーションセット
	// m_pPlayer->GetMotion()->SetMotion(CPlayer::MOTION_MOVE, true, 5);
}
//=========================================================
// 更新関数
//=========================================================
void CPlayerStateMove::OnUpdate()
{
	//// キー入力情報を取得
	//auto pKey = CManager::GetInstance()->GetInputKeyboard();
	//auto pPad = CManager::GetInstance()->GetJoyPad();

	//// 移動更新関数
	//m_pPlayer->MoveKey(pKey, pPad);
}
//=========================================================
// 終了関数
//=========================================================
void CPlayerStateMove::OnExit()
{

}