//===================================================================
//
// 選択されているモデルを示すオブジェクト [ pointobj.cpp ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "pointobj.h"
#include "template.h"

//===================================================================
// コンストラクタ
//===================================================================
CPointObj::CPointObj(int nPriority) : CObjectX(nPriority)
{

}
//===================================================================
// デストラクタ
//===================================================================
CPointObj::~CPointObj()
{

}
//===================================================================
// 生成処理
//===================================================================
CPointObj* CPointObj::Create(const D3DXVECTOR3& pos, const D3DXVECTOR3& rot)
{
	// インスタンス生成
	CPointObj* pPoint = new CPointObj;
	if (pPoint == nullptr) return nullptr;

	// オブジェクト設定
	pPoint->SetPos(pos);
	pPoint->SetRot(D3DXToRadian(rot));
	pPoint->SetFilePass(MODELNAME);

	// 初期化失敗時
	if (FAILED(pPoint->Init())) return nullptr;

	return pPoint;
}
//===================================================================
// 初期化処理
//===================================================================
HRESULT CPointObj::Init(void)
{
	// 親クラス初期化
	CObjectX::Init();
	return S_OK;
}
//===================================================================
// 終了処理
//===================================================================
void CPointObj::Uninit(void)
{
	// 親クラス終了
	CObjectX::Uninit();
}
//===================================================================
// 更新処理
//===================================================================
void CPointObj::Update(void)
{
	// オブジェクトの角度取得
	D3DXVECTOR3 rot = GetRot();

	// 角度加算
	rot.y += ROT_VALUE;
	rot.y = NormalAngle(rot.y);

	// 角度を割り当て
	SetRot(rot);

	// 親クラス更新
	CObjectX::Update();
}
//===================================================================
// 描画処理
//===================================================================
void CPointObj::Draw(void)
{
	// 親クラス描画
	CObjectX::Draw();
}