//=========================================================
//
// ランキングシーン処理 [ ranking.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "ranking.h"
#include "rankingobject.h"
#include "rankingmanager.h"
#include <memory>

//=========================================================
// コンストラクタ
//=========================================================
CRanking::CRanking() : CScene(CScene::MODE_RANKING)
{

}
//=========================================================
// デストラクタ
//=========================================================
CRanking::~CRanking()
{
	
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CRanking::Init(void)
{
	// ランキングマネージャーの初期化処理
	CRankingManager::GetInstance()->Init();

	// ランキングオブジェクトの初期化処理
	CRankingObject::GetInstance()->Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CRanking::Uninit(void)
{
	// ランキングマネージャーの終了処理
	CRankingManager::GetInstance()->Uninit();

	// ランキングオブジェクトの終了処理
	CRankingObject::GetInstance()->Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CRanking::Update(void)
{
	// ランキングマネージャーの更新処理
	CRankingManager::GetInstance()->Update();
}
//=========================================================
// 描画処理
//=========================================================
void CRanking::Draw(void)
{
	
}