//=========================================================
//
// タイトル処理 [ title.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル宣言
//*********************************************************
#include "title.h"
#include "manager.h"
#include "titlemanager.h"
#include "titleobject.h"

//=========================================================
// コンストラクタ
//=========================================================
CTitle::CTitle() : CScene(CScene::MODE_TITLE)
{

}
//=========================================================
// デストラクタ
//=========================================================
CTitle::~CTitle()
{

}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CTitle::Init(void)
{
	// マネージャー初期化処理
	CTitleManager::GetInstance()->Init();

	// タイトルオブジェクト処理
	CTitleObject::GetInstance()->Init();

	// 初期化結果を返す
	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CTitle::Uninit(void)
{
	// mマネージャー終了処理
	CTitleManager::GetInstance()->Uninit();

	// タイトルオブジェクト終了処理
	CTitleObject::GetInstance()->Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CTitle::Update(void)
{
	// マネージャー更新処理
	CTitleManager::GetInstance()->Update();

	// タイトルオブジェクト更新処理
	CTitleObject::GetInstance()->Update();
}
//=========================================================
// 描画処理
//=========================================================
void CTitle::Draw(void)
{
	// マネージャー描画処理
	CTitleManager::GetInstance()->Draw();

	// タイトルオブジェクト描画処理
	CTitleObject::GetInstance()->Update();
}
