//=========================================================
//
// アリで出すUI処理 [ workerui.cpp ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードファイル
//*********************************************************
#include "workerui.h"

//=========================================================
// コンストラクタ
//=========================================================
CWorkerUi::CWorkerUi(int nPriority) : CObject2D(nPriority)
{

}
//=========================================================
// デストラクタ
//=========================================================
CWorkerUi::~CWorkerUi()
{

}
//=========================================================
// 生成処理
//=========================================================
CWorkerUi* CWorkerUi::Create(const D3DXVECTOR3 pos, const float fWidth, const float fHeight)
{
	// インスタンス生成
	CWorkerUi* pUi = new CWorkerUi;
	if (pUi == nullptr) return nullptr;

	// 初期化失敗時
	if (FAILED(pUi->Init())) return nullptr;

	// オブジェクト設定
	pUi->SetPos(pos);
	pUi->SetSize(fWidth, fHeight);
	pUi->SetTexture("worker_icon.png");
	pUi->SetAnchor();

	return pUi;
}
//=========================================================
// 初期化処理
//=========================================================
HRESULT CWorkerUi::Init(void)
{
	// 親クラスの初期化
	CObject2D::Init();

	return S_OK;
}
//=========================================================
// 終了処理
//=========================================================
void CWorkerUi::Uninit(void)
{
	// 親クラスの終了
	CObject2D::Uninit();
}
//=========================================================
// 更新処理
//=========================================================
void CWorkerUi::Update(void)
{	
	//親クラスの更新
	CObject2D::Update();
}
//=========================================================
// 描画処理
//=========================================================
void CWorkerUi::Draw(void)
{
	// 親クラスの描画
	CObject2D::Draw();
}