//=========================================================
//
// 常に成功結果を返す末端ノードの処理 [ alwayssuccess.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "leafnodebase.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CBlackBoard;

//*********************************************************
// 成功を常に返すノードクラスを定義
//*********************************************************
class CAlwaysSuccessLeaf : public CLeafNodeBase
{
public:

	CAlwaysSuccessLeaf(CBlackBoard* blackboard) : CLeafNodeBase(blackboard) {};
	~CAlwaysSuccessLeaf() = default;

	/// <summary>
	/// 常に成功である値を返す関数
	/// </summary>
	/// <returns></returns>
	NodeInfo::NodeResult get_node_result() const override
	{
		// 成功の番号を返す
		return NodeInfo::NodeResult::Re_SUCCESS;
	}
};