//=========================================================
//
// 常に失敗結果を返す末端ノードの処理 [ alwaysfail.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "leafnodebase.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CBlackBoard;

//*********************************************************
// 常に失敗を返すクラスを定義
//*********************************************************
class CAlwaysFailLeaf : public CLeafNodeBase
{
public:

	CAlwaysFailLeaf(CBlackBoard* blackboard) : CLeafNodeBase(blackboard) {};
	~CAlwaysFailLeaf() = default;

	/// <summary>
	/// 常に失敗である値を返す関数
	/// </summary>
	/// <returns></returns>
	NodeInfo::NodeResult get_node_result() const override
	{
		// 失敗の番号を返す
		return NodeInfo::NodeResult::Re_FAIL;
	}
};