//=========================================================
//
// 範囲内にいるかチェックする処理 [ arraychecknear.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "branchnodebase.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CBlackBoard;

//*********************************************************
// 対象オブジェクトが近くにあるか判定をするクラスを定義
//*********************************************************
class CArrayCheckNear : public CBranchNodeBase
{
public:

	CArrayCheckNear(CBlackBoard* blackboard, CNode* TrueNode, CNode* FalseNode, const float fDistance);
	~CArrayCheckNear() = default;

private:

	const bool IsCondition() override;

	float m_fDistance = NULL; // 判定半径格納
};

