//===================================================================
//
// 仲間アリのAIツリーを管理するクラス [ arraybehaviortree.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// 前方宣言
//*******************************************************************
class CBlackBoard;
class CNode;

//*******************************************************************
// 仲間のツリーを動かすクラスを定義
//*******************************************************************
namespace ArrayTree
{
	class CArrayBehaviorTree
	{
	public:

		CArrayBehaviorTree() = default;
		~CArrayBehaviorTree() = default;

		static CNode* SetArrayTreeNode(CBlackBoard* blackboard);

	private:
	};
};

