//===================================================================
//
// 目的の任意の場所に移動するノードの処理 [ chasedestination.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once 

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "leafnodebase.h"

//*******************************************************************
// 前方宣言
//*******************************************************************
class CBlackBoard;

//*******************************************************************
// 目的の場所に向かっていく移動ノードクラスを定義
//*******************************************************************
class CChaseDestinationLeaf : public CLeafNodeBase
{

public:

	CChaseDestinationLeaf(CBlackBoard * blackboard);
	~CChaseDestinationLeaf() = default;

	void Update() override;

	NodeInfo::NodeResult get_node_result() const override
	{
		// 成功を返す
		return NodeInfo::NodeResult::Re_SUCCESS;
	};

private:
};