//======================================================================
//
// 追跡対象が近くにいるかを判別するノード処理 [ checkneardestination.h ]
// Author: Asuma Nishio
//
//======================================================================

//**********************************************************************
// インクルードガード
//**********************************************************************
#pragma once

//**********************************************************************
// インクルードファイル
//**********************************************************************
#include "branchnodebase.h"

//**********************************************************************
// 前方宣言
//**********************************************************************
class CBlackBoard;

//**********************************************************************
// 対象オブジェクトが近くにあるか判定をするクラスを定義
//**********************************************************************
class CCheckNearDestination : public CBranchNodeBase
{
public:

	CCheckNearDestination(CBlackBoard * blackboard,CNode * TrueNode,CNode * FalseNode,float fDistance);
	~CCheckNearDestination() = default;

private:

	const bool IsCondition() override;	// 判別関数
	float m_fDistance = NULL;			// 距離判別用
};