//=========================================================
//
// 敵の移動状態処理 [ enemystatemove.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemystatebase.h"

//*********************************************************
// 移動状態管理クラスを定義
//*********************************************************
class CEnemyStateMove : public CEnemyStateBase
{
public:
	
	CEnemyStateMove();
	~CEnemyStateMove();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};

