//===================================================================
//
// 巣に帰る末端ノードのクラス処理 [ enemyreturnleaf.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "leafnodebase.h"

//*******************************************************************
// 巣に帰る末端ノードのクラスを定義
//*******************************************************************
class CEnemyReturnLeaf : public CLeafNodeBase
{
public:

	CEnemyReturnLeaf(CBlackBoard* blackboard) : CLeafNodeBase(blackboard) {};
	~CEnemyReturnLeaf() = default;

	void Update() override;

	NodeInfo::NodeResult get_node_result() const override
	{
		// 成功を返す
		return NodeInfo::NodeResult::Re_SUCCESS;
	};

private:

	//******************************
	// 定数構造体
	//******************************
	struct Config
	{

	};
};