//=========================================================
//
// 一定の範囲内にいるかチェックする処理 [ enmychecknear.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "branchnodebase.h"

//*********************************************************
// 前方宣言
//*********************************************************
class CBlackBoard;

//*********************************************************
// 対象オブジェクトが近くにあるか判定をするクラスを定義
//*********************************************************
class CEnemyCheckNear : public CBranchNodeBase
{
public:

	CEnemyCheckNear(CBlackBoard * blackboard, CNode* TrueNode, CNode* FalseNode,const float fDistance);
	~CEnemyCheckNear() = default;

private:

	const bool IsCondition() override;

	float m_fDistance = NULL; // 判別半径
};