//=========================================================
//
// 敵の待機状態管理処理 [ enemystateneutral.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "enemystatebase.h"

//*********************************************************
// 待機状態のクラス
//*********************************************************
class CEnemyStateNeutral : public CEnemyStateBase
{
public:

	CEnemyStateNeutral();
	~CEnemyStateNeutral();

	void OnStart();
	void OnUpdate();
	void OnExit();

private:

};

