//=========================================================
//
// 敵のAIツリーを管理するクラス [ enemybehaviortree.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 前方宣言
//*********************************************************
class CBlackBoard;
class CNode;

//*********************************************************
// 実際に敵のツリーを動かすクラスを定義
//*********************************************************
namespace EnemyTree
{
	class CEnemyBehaviorTree
	{
	public:

		CEnemyBehaviorTree() = default;
		~CEnemyBehaviorTree() = default;

		static CNode* SetEnemyTreeNode(CBlackBoard* blackboard);

	private:

	};
};