//=========================================================
//
// ステージギミック管理処理 [ gimmickmanager.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include <vector>

//*********************************************************
// ギミッククラスを定義
//*********************************************************
class CGimmickManager
{
public:

	//**********************
	// 起こるギミックの種類
	//**********************
	enum TYPE
	{
		TYPE_STORM,
		TYPE_MAX,
	};

	CGimmickManager();
	~CGimmickManager();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void SetType(const int nType) { m_Type = static_cast<TYPE>(nType); }

private:

	TYPE m_Type; // 種類情報
};