//=========================================================
//
// jsonファイル読み込み管理処理 [ jsonmanager.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// インクルードファイル
//*********************************************************
#include <string>
#include <memory>
#include <unordered_map>

//*********************************************************
// 前方宣言
//*********************************************************
class CJsonCreator;

//*********************************************************
// jsonを一括管理するクラスを定義
//*********************************************************
class CJsonManager
{
public:

	CJsonManager();
	~CJsonManager();

	HRESULT Load(const char* LoadFileName);
	HRESULT Init(void);
	void Uninit(void);

private:

	std::unordered_map<std::string, std::unique_ptr<CJsonCreator>> m_Creator; // 生成するオブジェクトのマップ配列
};