//=========================================================
//
// 移動状態管理処理 [ playerstatemove.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// 移動状態管理クラスを定義
//*********************************************************
class CPlayerStateMove : public CPlayerStateBase
{
public:

	CPlayerStateMove();
	~CPlayerStateMove();

	void OnStart(void);
	void OnUpdate(void);
	void OnExit(void);

private:

};