//=========================================================
//
// ニュートラル状態管理処理 [ playerstateneutral.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include "playerstatebase.h"

//*********************************************************
// 待機状態クラスを定義
//*********************************************************
class CPlayerStateNeutral : public CPlayerStateBase
{
public:

	CPlayerStateNeutral();
	~CPlayerStateNeutral();

	void OnStart(void) override;
	void OnUpdate(void) override;
	void OnExit(void) override;

private:

};