//=========================================================
//
// リザルトシーン管理処理 [ resultmanager.h ]
// Author: Asuma Nishio
// 
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// 前方宣言
//*********************************************************
class CResultScore;

//*********************************************************
// リザルト管理クラスを定義
//*********************************************************
class CResultManager
{
public:

	~CResultManager();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CResultManager* GetInstance(void);

private:

	CResultManager();
};