//===================================================================
//
// ゲーム起動時に関するシーンの処理 [ startexe.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once 

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "scene.h"

//*******************************************************************
//  ゲーム起動時のシーンクラスを定義
//*******************************************************************
class CStartExeScene : public CScene
{
public:

	CStartExeScene();
	~CStartExeScene();

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;

private:

};