//=========================================================
//
// 状態管理基底処理 [ state.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once 

//*********************************************************
// ステートベースクラス
//*********************************************************
class CStateBase
{
public:

	CStateBase();
	virtual ~CStateBase();

	virtual void OnStart() {}
	virtual void OnUpdate() {}
	virtual void OnExit() {}

	virtual int GetID() const = 0;
};