//===================================================================
//
// ターゲットを選択するセレクターノード処理 [ targetselector.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "selector.h"

//*******************************************************************
// 前方宣言
//*******************************************************************
class CBlackBoard;

//*******************************************************************
// ターゲットをランダムで選択して実行するノードクラスを定義
//*******************************************************************
class CTargetSelector : public CSelector
{
public:

	CTargetSelector(CBlackBoard* blackboard) : CSelector(blackboard) {};
	~CTargetSelector() override = default;

	void Update() override
	{
		// 子ノードが見つからなかったら
		if (m_ChildeNode.empty())
		{
			m_NodeResult = NodeInfo::NodeResult::Re_FAIL;
			return;
		}

		// ランダムで子ノードを選択
		int randomIndex = rand() % m_ChildeNode.size();

		// そのノードだけ実行
		m_ChildeNode[randomIndex]->Update();

		// 子ノードの結果を返す
		m_NodeResult = m_ChildeNode[randomIndex]->get_node_result();

		// ノードの終了
		Exit();
	}
};