//=========================================================
//
// タイトルのアリを管理する処理 [ titleantmanager.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// インクルードファイル
//*********************************************************
#include <vector>

//*********************************************************
// 前方宣言
//*********************************************************
class CTitleAnt;

//*********************************************************
// タイトルのアリ全体を管理するクラスを定義
//*********************************************************
class CTitleAntManager
{
public:

	CTitleAntManager();
	~CTitleAntManager();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:

	std::vector<CTitleAnt*>m_pAnts; // アリの動的配列
	int m_nCreateCount;				// 生成カウント
};