//=========================================================
//
// アリで出すUIの複数管理処理 [ workeruimanager.h ]
// Author: Asuma Nishio
//
//=========================================================

//*********************************************************
// インクルードガード
//*********************************************************
#pragma once

//*********************************************************
// 前方宣言
//*********************************************************
class CWorkerUi;

//*********************************************************
// 複数管理クラスを定義
//*********************************************************
class CWorkerUiManager
{
public:

	CWorkerUiManager();
	~CWorkerUiManager();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);

private:

	static constexpr int NUM_UI = 3; // 表示数

	CWorkerUi* m_pWorkUi[NUM_UI];		// クラスポインタ
};