//===================================================================
//
// 指示アリの待機状態管理処理クラス [ workerstateneutral.h ]
// Author: Asuma Nishio
//
//===================================================================

//*******************************************************************
// インクルードガード
//*******************************************************************
#pragma once

//*******************************************************************
// インクルードファイル
//*******************************************************************
#include "workerstatebase.h"

//*******************************************************************
// 待機状態管理クラスを定義
//*******************************************************************
class CWorkerStateNeutral : public CWorkerStateBase
{
public:

	CWorkerStateNeutral();
	~CWorkerStateNeutral();

	void OnStart() override;
	void OnUpdate() override;
	void OnExit() override;
	
private:

};